const QnaData = [
    {
        "id": 1,
        "title": "계획형 VS 충동형",
        "type": "PS",
        "qnaList": [
            {
                "qnaId": 1,
                "qna": "당신이 돈을 가장 많이 쓰는 타이밍은?",
                "answerList": [
                    "정해진 시기/필요한 타이밍에 맞춰 쓴다.", 
                    "기분이 좋거나 즉흥적으로 뭔가 하고 싶을 때 쓴다."
                ]
            },
            {
                "qnaId": 2,
                "qna": "갑자기 사고 싶은게 생겼을 때 당신은?",
                "answerList": [
                    "며칠 고민하고 예산과 비교해 결정한다.", 
                    "후회할지라도 일단 지르고 본다."
                ]
            },
            {
                "qnaId": 3,
                "qna": "지출 내역을 점검해본 적이 있나요?",
                "answerList": [
                    "자주 확인하며 기록한다.", 
                    "거의(한 번도) 안 해본다."
                ]
            },
        ]
    },
    {
        "id": 2,
        "title": "절약형 VS 자유소비형",
        "type": "TF",
        "qnaList": [
            {
                "qnaId": 4,
                "qna": "배달 앱을 사용할 때 기준은?",
                "answerList": [
                    "배달비가 저렴하거나 메뉴를 할인하는 가게 위주", 
                    "무조건 먹고 싶은 메뉴 우선"
                ]
            },
            {
                "qnaId": 5,
                "qna": "작은 지출에 대한 당신의 마음가짐은?",
                "answerList": [
                    "티클 모아 태산! 줄이려고 노력한다.", 
                    "이건 못 참지! 인생의 소확행이니까"
                ]
            },
            {
                "qnaId": 6,
                "qna": "할인하는 물건을 보았을 때 당신은?",
                "answerList": [
                    "필요 없는 물건은 구매하지 않는다.", 
                    "안 사면 손해! 구매한다."
                ]
            },
        ]
    },
    {
        "id": 3,
        "title": "목표기반 소비 VS 감정적인 소비",
        "type": "GE",
        "qnaList": [
            {
                "qnaId": 7,
                "qna": "계획에 따라 지출을 하나요?",
                "answerList": [
                    "목표와 계획에 맞게 저축/지출 항목을 나눈다.", 
                    "그날의 기분 따라 소비하거나 따로 계획을 짜지 않는다."
                ]
            },
            {
                "qnaId": 8,
                "qna": "여행 갈 때 당신은?",
                "answerList": [
                    "예산 내에서 알차게 계획을 짠다.", 
                    "즐거우면 됐잖아~ 여행에 돈 아끼지 않는다."
                ]
            },
            {
                "qnaId": 9,
                "qna": "큰 돈이 생겼을 때 당신은?",
                "answerList": [
                    "계획한 곳에 쓰거나 저축/투자한다.", 
                    "평소 궁금했던 걸 질러본다."
                ]
            }
        ]
    },
]

export default QnaData;